Autodesk.Revit.DB.FDXExportOptions.SourceFileVersionUrn
The "sourceFileVersionUrn" parameter to pass during FDX fulfillment creation.
Since:
2023

Autodesk.Revit.DB.FDXExportOptions.FulfillmentId
The string ID of an open FDX fulfillment on the specified exchange. If non-empty, the open fulfillment will be used for export.
If empty, Revit will create a new fulfillment and close the fulfillment if export is successful.
Since:
2023

Autodesk.Revit.DB.FDXExportOptions.LogOutputPath
Path to write JSON log file of FDX fulfillment. Should have *.json extension. No log is written if path is empty.
Since:
2023

Autodesk.Revit.DB.FDXExportOptions.LogVerbosity
Value specifying the level of FDX logging - see FDXLogVerbosity.
Since:
2023

Autodesk.Revit.DB.FDXExportOptions.#ctor
Constructs a new instance of FDXExportOptions with default values of all properties.
Since:
2023

Autodesk.Revit.DB.FDXExportOptions
The export options used for publishing to an FDX exchange.
Since:
2023